Left/esp8266_wifi_clock/sceleton.h
            const char c = *val;
            int x = (c >= '0' && c <= '9') ? (c - '0') : (c - 'A' + 10);
            toAdd |= (x << (28 - i*4));
        }
        resArr.push_back(toAdd);
    }
    return resArr;
}

bool wasConnected = false;
uint32_t saveBrightnessAt = 0x7FFFFFFF;

void setup(Sink* _sink) {
    sink = _sink;
    // Serial1.setDebugOutput(true);
    // Serial1.begin(2000000);
    // Serial.begin(2000000);
    SPIFFS.begin();

    debugSerial = &Serial;   
    debugSerial->begin(230400);
    debugSerial->println("\n\n=====================");

    long was = millis();

    {   // Read initial settings
        DynamicJsonDocument jsonBuffer(1000);
        String readVal = fileToString("settings.json");
        DeserializationError error = deserializeJson(jsonBuffer, readVal.c_str(), readVal.length());
        if (error == DeserializationError::Ok) {
            const JsonObject &root = jsonBuffer.as<JsonObject>();
            for (DevParam* d : devParams) {
                d->_value = (const char*) (root[d->_jsonName]);
            }
        } else {
            debugSerial->println("No settings read, use defaults");    
        }
    }

    msBeforeRestart = atoi(secondsBeforeRestart._value.c_str());

    debugSerial->println("Initialized in " + String(millis() - was, DEC));
    debugSerial->println(wifiName._value.c_str());
    debugSerial->println(wifiPwd._value.c_str());

    WiFi.persistent(false);
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.setPhyMode(WIFI_PHY_MODE_11G);
    WiFi.setSleepMode(WIFI_NONE_SLEEP);

    if (wifiName._value.length() > 0 && wifiPwd._value.length() > 0) {
        WiFi.mode(WIFI_STA);
        WiFi.hostname("ESP_" + deviceName._value);
        WiFi.onStationModeDisconnected(onDisconnect);
        WiFi.begin(wifiName._value.c_str(), wifiPwd._value.c_str());
        // WiFi.waitForConnectResult();
    }
/*
    if (WiFi.status() == WL_CONNECTED) {
        IPAddress ip = WiFi.localIP();
        initializedWiFi = true;
        debugSerial->println("Connected to WiFi " + ip.toString());
    } else {
        WiFi.mode(WIFI_AP);

        String chidIp = String(ESP.getChipId(), HEX);
        String wifiAPName = ("ESP") + chidIp; // + String(millis() % 0xffff, HEX)
        String wifiPwd = String("pass") + chidIp;
        WiFi.softAP(wifiAPName.c_str(), wifiPwd.c_str(), 3); // , millis() % 5 + 1
        // WiFi.softAPConfig(IPAddress(192, 168, 4, 22), IPAddress(192, 168, 4, 9), IPAddress(255, 255, 255, 0));

        IPAddress accessIP = WiFi.softAPIP();
        debugSerial->println(String("ESP AccessPoint name       : ") + wifiAPName);
        debugSerial->println(String("ESP AccessPoint password   : ") + wifiPwd);
        debugSerial->println(String("ESP AccessPoint IP address : ") + accessIP.toString());

        // sink->showMessage((String("WiFi: ") + wifiAPName + ", password: " + wifiPwd + ", " + accessIP.toString()).c_str(), 0xffff);
    }
*/

    if (websocketServer._value.length() > 0) {
        webSocketClient.reset(new WebSocketsClient());
        auto wsHandler = [&](WStype_t type, uint8_t *payload, size_t length) {
            switch (type) {
                case WStype_ERROR: {
                    debugSerial->println("WStype_ERROR");
                    break;
                }
                case WStype_CONNECTED: {
                    reconnectWebsocketAt = 0x7FFFFFFF;  // No need to reconnect anymore
                    debugSerial->println("Connected to server");
                    lastReceived = millis();
                    wasConnected = true;

                    String devParamsStr = "{ ";
                    bool first = true;
                    for (DevParam* d : devParams) {
                        if (!d->_password && d->_value != "false") {
                            if (!first) { 
                                devParamsStr += ",";
                            }
                            first = false;
                            devParamsStr += "\"",
                            devParamsStr += d->_name;
                            devParamsStr += "\": \"",
                            devParamsStr += d->_value;
                            devParamsStr += "\" ";
                        }
                    }
                    devParamsStr += "}";

                    debugSerial->println("Before sending HELLO");

                    // Let's say hello and show all we can
                    send(String("{ ") +
                        "\"type\":\"hello\", " +
                        "\"firmware\":\"" + firmwareVersion + "\", " +
                        "\"devParams\": " + devParamsStr + ", " + 
                        "\"screenEnabled\": " + sink->screenEnabled() + ", " + 
                        "\"deviceName\":\"" + sceleton::deviceName._value + "\"" + 
                        " }");

                    // send message to client
                    // debugPrint("Hello server " + " (" + sceleton::deviceName._value +  "), firmware ver = " + firmwareVersion);
                    debugSerial->println("Hello sent");

                    int cnt = 0;
                    for (const char* p = sceleton::relayNames._value.c_str(); *p != 0; ++p) {
                        if (*p == ';') {
                            if (cnt == 0) {
                                cnt = 1;
                            }

                            cnt++;
                        }
                    }

                    if (cnt > 0) {
                        for (int id = 0; id < cnt; ++id) {
                            send("{ \"type\": \"relayState\", \"id\": " + String(id, DEC) + ", \"value\":" + (sink->relayState(id) ? "true" : "false") + " }");
                        }
                        debugSerial->println("Relays state sent");
                    }

                    if (sceleton::hasLedStripe._value == "true") {
                        send("{ \"type\": \"ledstripeState\", \"value\":\"" + encodeRGBWString(sink->getLedStripe()) + "\" }");
                        debugSerial->println("LED stripe state sent");
                    }

                    break;
                }
                case WStype_TEXT: {
                    // debugSerial->printf("[%u] get Text: %s\n", payload);
                    DynamicJsonDocument jsonBuffer(1000);

                    DeserializationError error = deserializeJson(jsonBuffer, payload);

                    if (error) {
                        // debugSerial->println("parseObject() failed");
                        send("{ \"errorMsg\":\"Failed to parse JSON\" }");
                        return;
                    }
                    lastReceived = millis();

                    const JsonObject &root = jsonBuffer.as<JsonObject>();

                    String type = root[typeKey];
                    if (type == "ping") {
                        debugSerial->print(String(millis(), DEC) + ":");debugSerial->print("Ping "); debugSerial->println((const char*)(root["pingid"]));
                        String res = "{ \"type\": \"pingresult\", \"pid\":\"";
                        res += (const char*)(root["pingid"]);
                        res += "\" }";
                        send(res);
                    } else if (type == "switch") {
                        // debugSerial->println("switch!");
                        bool sw = root["on"] == "true";
                        uint32_t id = atoi(root["id"]);
                        sink->switchRelay(id, sw);
                        reportRelayState(id);
                    } else if (type == "setProp") {
                        saveSettings();
                    } else if (type == "show") {
                        sink->showMessage(root["text"], root["totalMsToShow"].as<int>());
                    } else if (type == "tune") {
                        sink->showTuningMsg(root["text"]);
                    } else if (type == "unixtime") {
                        sink->setTime(root["value"].as<int>());
                    } else if (type == "ledstripe") {
                        const char* val = (const char*)(root["value"]);
                        sink->setLedStripe(decodeRGBWString(val));
                    #ifndef ESP01
                    } else if (type == "screenEnable") {
                        int val = root["value"].as<boolean>();
                        sink->enableScreen(val);
                        saveBrightnessAt = millis() + 1000; // In 1 second, save brightness
                    } else if (type == "brightness") {
                        int val = root["value"].as<int>();
                        val = std::max(std::min(val, 100), 0);
                        sink->setBrightness(val);
                        brightness._value = String(val, DEC);
                        saveBrightnessAt = millis() + 1000; // In 1 second, save brightness
                    #endif
                    } else if (type == "additional-info") {
                        // 
                        sink->setAdditionalInfo(root["text"]);
                    } else if (type == "reboot") {
                        debugPrint("Let's reboot self");
                        sink->reboot();
                    }
                    break;
                }
                case WStype_BIN: {
                    // debugSerial->printf("[%u] get binary length: %u\n", length);
                    // hexdump(payload, length);
                    debugPrint("Received binary packet of size " + String(length, DEC));

                    // send message to client
                    // webSocketClient.sendBIN(payload, length);
                    break;
                }
                case WStype_DISCONNECTED: {
                    // debugSerial->print(String(millis(), DEC) + ":"); debugSerial->printf("Disconnected [%u]!\n", WiFi.status());
                    if (WiFi.status() == WL_CONNECTED && wasConnected) {
                        wasConnected = false;
                        debugSerial->println("Disconnected from server " + String(length, DEC));
                        reconnectWebsocketAt = millis() + 2000; // In 2 second, let's try to reconnect
                    }
                    break;
                }
                default:
                    debugSerial->println("Unknown type: " + String(type, DEC));
            }
        };

        webSocketClient->onEvent(wsHandler);
    } else {
        // debugSerial->println("Please configure server to connect");
    }

    setupServer.reset(new AsyncWebServer(80));
    setupServer->on("/http_settup", [](AsyncWebServerRequest *request) {
        bool needReboot = false;
        for (DevParam* d : devParams) {
            if (request->hasParam(d->_name)) {
                // Param is set
                String val = request->getParam(d->_name)->value();
                if (!d->_password || val.length() > 0) {
                    if (d->_value != val) {
                        d->_value = val;
                        needReboot = true;
                    }
                }
            }
        }
        
        if (needReboot) {
            saveSettings();
            request->send(200, "text/html", "Settings changed, rebooting...");  
            sink->reboot();
        } else {
            request->send(200, "text/html", "Nothing changed.");  
        }
    });
    setupServer->on("/", [](AsyncWebServerRequest *request) {
        String content = "<!DOCTYPE HTML>\r\n<html>";
        content += "<head>";
        content += "<meta http-equiv=\"content-type\" content=\"text/html; charset=UTF-8\">";
        content += "</head>";
        content += "<body>";
        content += "<p>";
        content += "<form method='get' action='http_settup'>";
        for (DevParam* d : devParams) {
            content += "<label class='lbl'>";
                content += d->_description;
                content += ":</label>";
            content +="<input name='";
                content += d->_name;
                content += "' value='";
                content += d->_password ? String("") : d->_value;
                content += "' length=32/><br/>";
        }
        content += "<input type='submit'></form>";
        content += "<form action='/reboot'><input type='submit' value='Reboot'/></form>";
        content += "</html>";
        request->send(200, "text/html", content);  
    });
    setupServer->on("/reboot", [](AsyncWebServerRequest *request) {
        rebootAt = millis() + 100;
    });
    setupServer->onNotFound([](AsyncWebServerRequest *request) {
        request->send(404, "text/plain", "Not found: " + request->url());
    });
    setupServer->begin();

    // ArduinoOTA.setPort(8266);
    // set host name
    // ArduinoOTA.setHostname(deviceName._value.c_str());

