Left/esp8266_wifi_clock/sceleton.h
/*
    ArduinoOTA.onStart([]() {
        // debugSerial->println("Start OTA");  //  "Начало OTA-апдейта"
        sink->showMessage("Updating...", 10000);
    });
    ArduinoOTA.onEnd([]() {
        // debugSerial->println("End OTA");  //  "Завершение OTA-апдейта"
        sink->showMessage("Done...", 10000);
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        // debugSerial->printf("Progress: %u%%\r", (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
        debugSerial->printf("Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) {
            // debugSerial->println("Auth Failed");
            //  "Ошибка при аутентификации"
        } else if (error == OTA_BEGIN_ERROR) {
            // debugSerial->println("Begin Failed"); 
            //  "Ошибка при начале OTA-апдейта"
        } else if (error == OTA_CONNECT_ERROR) {
            // debugSerial->println("Connect Failed");
            //  "Ошибка при подключении"
        } else if (error == OTA_RECEIVE_ERROR) {
            // debugSerial->println("Receive Failed");
            //  "Ошибка при получении данных"
        } else if (error == OTA_END_ERROR) {
            // debugSerial->println("End Failed");
            //  "Ошибка при завершении OTA-апдейта"
        }
    });
*/
    // debugSerial->println("ArduinoOTA.begin");
}

int32_t lastEachSecond = millis() / 1000;
int32_t lastWiFiState = millis();
int32_t lastLoop = millis();

int32_t oldStatus = WiFi.status();
int32_t nextReconnect = millis();

void loop() {
    if (millis() - lastLoop > 50) {
         debugSerial->println(String("Long loop: ") + String(millis() - lastLoop, DEC));
    }
    lastLoop = millis();

    if (WiFi.status() != WL_CONNECTED && (millis() > nextReconnect)) {
        debugSerial->println(String("WiFi.status() check: ") + WiFi.status());
        bool ret = WiFi.reconnect();
        debugSerial->println(String("Reconnect returned ") + String(ret, DEC));
        nextReconnect = millis() + (ret ? 3000 : 300);
    }

    if (oldStatus != WiFi.status()) {
        oldStatus = WiFi.status();
        debugSerial->println(String("WiFi.status(): ") + WiFi.status());

        if (WiFi.status() == WL_IDLE_STATUS || WiFi.status() == WL_DISCONNECTED) {
            long l = millis();
            debugSerial->println("Reconnecting");
            WiFi.reconnect();
        }

        if (WiFi.status() == WL_CONNECTED) {
            debugSerial->println(String("Connected to WiFi, IP:") + WiFi.localIP().toString());
            reconnectWebsocketAt = millis() + 5; // Wait 1 ms and connect to websocket
            // ArduinoOTA.begin(); // Begin OTA immediately
            initializedWiFi = true;
        }
    }

    if (millis() >= reconnectWebsocketAt) {
        if (webSocketClient.get() != NULL) {
            debugSerial->println(String("webSocketClient connecting to ") + websocketServer._value.c_str());
            webSocketClient->disconnect();
            uint32_t ms = millis();
            webSocketClient->begin(websocketServer._value.c_str(), websocketPort._value.toInt(), "/esp");
            debugSerial->println(String("webSocketClient.begin() took " + String(millis() - ms, DEC)));
            reconnectWebsocketAt = millis() + 5000; // 5 seconds should be enough to cennect WS
        }
    }

    if (initializedWiFi) {
        // ArduinoOTA.handle();
        if (webSocketClient.get() != NULL) {
            uint32_t ms = millis();
            webSocketClient->loop();
            if ((millis() - ms) > 10) {
                debugSerial->println(String("webSocketClient.loop() took " + String(millis() - ms, DEC)));
            }
        }
    }

#ifndef ESP01
/*
    if (millis() / 1000 != lastEachSecond) {
        lastEachSecond = millis() / 1000;
        // Set brightness if saved
        if (sceleton::hasScreen._value == "true") {
            sink->setBrightness(brightness._value.toInt());
        }
        // vccVal = ESP.getVcc();
    }
*/
#endif

    if (initializedWiFi) {
        if (millis() - lastReceived > msBeforeRestart) {
            //debugSerial->println("Rebooting...");
            if (reportedGoingToReconnect <= lastReceived) {
                sink->showMessage((String(msBeforeRestart / 1000, DEC) + " секунд без связи с сервером, перезагружаемся").c_str(), 3000);
                debugSerial->println(String(msBeforeRestart / 1000, DEC) + " seconds w/o connect to server");
                reportedGoingToReconnect = millis();
            }

            rebootAt = millis();
        }

        if (rebootAt <= millis()) {
            sink->reboot();
        }
    }

    if (saveBrightnessAt < millis()) {
        saveSettings();
        saveBrightnessAt = 0x7FFFFFFF;
    }
/*
    if (millis() % 1000 == 0) {
        debugSerial->println("Heap size: " + String(ESP.getFreeHeap(), DEC) + " bytes");
    }
*/
}

} // namespace

void debugPrint(const String& str) {
    if (sceleton::webSocketClient.get() != NULL) {
        String toSend;
        toSend = "{ \"type\": \"log\", \"val\": \"" + str + "\" }";

        sceleton::send(toSend);
    }
}
